Австралия/src/Catalogs/DiscountCardsTemplates/DiscountCardsTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DiscountCardsTemplates</name>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Suffix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BlocksDelimiter</name>
    <comment>Delimiting character of track blocks</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstFieldSymbolNumber</name>
    <comment>Number of the track field first symbol</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FieldLenght</name>
    <comment>Track fields lenght</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BlockNumber</name>
    <comment>Track block number</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NoSizeRestriction</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeLength</name>
    <comment>The code length of the first path</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/DiscountCardsTemplates/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region PredeterminedProceduresEventsHandlers

// Procedure - FillingProcessor event handler.
//
Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If IsNew() Then
		Prefix = ";";
		Suffix = "?";
		BlocksDelimiter = "=";
	EndIf;
	
EndProcedure

// Procedure - FillCheckProcessing event handler.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then 
		Return;
	EndIf;
	
	If CodeLength = 0 Then
		NoSizeRestriction = True;
	Else
		NoSizeRestriction = False;
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
